[
  {
    "id": "plan__learning-roadmap__2025-12",
    "title": "Learning & Certification Roadmap",
    "type": "plan",
    "date": {
      "start": "2025-12",
      "end": ""
    },
    "summary": "AWS Lambda\nMachine Learning\nA highly skilled and versatile engineer with expertise in software development, machine learning, DevOps, and electrical engineering. Passionate about automation, AI-driven solutions, and scalable infrastructure. Proven track record in AI-based applications, cloud computing, and hardware innovations.\nSoftware & AI Development: Python, C, C++, JavaScript, Vue.js, machine learning, data science, algorithmic trading.\nDevOps & Cloud: AWS (Cloud Practitioner, Solutions Architect, AI Practitioner), Docker, Kubernetes, Terraform, CI/CD automation.\nWith a problem-solving mindset and a commitment to continuous learning, I strive to create innovative software and hardware solutions that enhance efficiency, security, and automation across industries. 🚀\nJohns Hopkins University\nAdvanced Statistics for Data Science — Johns Hopkins University (Coursera). Statistical inference, hypothesis testing and experimental design for DS\nCertified in Fundamentals of Databricks\nCoursera Project Network\nCertified in Fundamentals of Databricks\nCoursera Project Network\nCertified in Fundamentals of Databricks\n…",
    "domains": [
      "events"
    ],
    "tags": [
      "roadmap"
    ],
    "importance": "standard",
    "links": {}
  },
  {
    "id": "raw__linkedin-website-export__2025-12",
    "title": "Source Export: LinkedIn + Website",
    "type": "raw",
    "date": {
      "start": "2025-12",
      "end": ""
    },
    "summary": "LINKEDIN INFORMATION\nAbout\nI’m a Data and ML-focused Engineer with experience building real-time machine learning services, automated data pipelines and production-ready APIs. I enjoy taking complex technical problems and turning them into reliable, efficient systems that reduce manual work and deliver faster insights.\nMy recent work includes Python-based ETL pipelines processing more than 100,000 images a day, Apache Airflow DAGs with CI testing, and optimising YOLO and ResNet models for GPU deployment. I’ve also delivered Dockerised microservices, monitoring dashboards in Grafana and Prometheus, and workflow automation that improved operational efficiency for clients.\nI’m comfortable working across the full engineering stack – Python, SQL, Linux, Docker, GitLab CI/CD, REST APIs and AWS services – and I bring a practical understanding of data science and feature engineering to support model development and automation.\nI’m now looking for opportunities in Data Engineering, ML Engineering, Software Engineering or Process Automation where I can contribute to scalable systems, strengthen my engineering skills and continue building high-impact solutions.\nAll activity\n…",
    "domains": [
      "events"
    ],
    "tags": [
      "raw",
      "source"
    ],
    "importance": "mini",
    "links": {}
  }
]